sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim_ex.c
    /* Reset the IC1PSC Bits */
    htim->Instance->CCMR1 &= ~TIM_CCMR1_IC1PSC;
    /* Set the IC1PSC value */
    htim->Instance->CCMR1 |= sConfig->IC1Prescaler;

    /* Enable the Hall sensor interface (XOR function of the three inputs) */
    htim->Instance->CR2 |= TIM_CR2_TI1S;

    /* Select the TIM_TS_TI1F_ED signal as Input trigger for the TIM */
    htim->Instance->SMCR &= ~TIM_SMCR_TS;
    htim->Instance->SMCR |= TIM_TS_TI1F_ED;

    /* Use the TIM_TS_TI1F_ED signal to reset the TIM counter each edge detection */
    htim->Instance->SMCR &= ~TIM_SMCR_SMS;
    htim->Instance->SMCR |= TIM_SLAVEMODE_RESET;

    /* Program channel 2 in PWM 2 mode with the desired Commutation_Delay*/
    OC_Config.OCFastMode = TIM_OCFAST_DISABLE;
    OC_Config.OCIdleState = TIM_OCIDLESTATE_RESET;
    OC_Config.OCMode = TIM_OCMODE_PWM2;
    OC_Config.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    OC_Config.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    OC_Config.OCPolarity = TIM_OCPOLARITY_HIGH;
    OC_Config.Pulse = sConfig->Commutation_Delay;

    TIM_OC2_SetConfig(htim->Instance, &OC_Config);

    /* Select OC2REF as trigger output on TRGO: write the MMS bits in the TIMx_CR2
      register to 101 */
    htim->Instance->CR2 &= ~TIM_CR2_MMS;
    htim->Instance->CR2 |= TIM_TRGO_OC2REF;

    /* Initialize the TIM state*/
    htim->State = HAL_TIM_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  DeInitializes the TIM Hall Sensor interface
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_DeInit(TIM_HandleTypeDef *htim)
{
    /* Check the parameters */
    assert_param(IS_TIM_INSTANCE(htim->Instance));

    htim->State = HAL_TIM_STATE_BUSY;

    /* Disable the TIM Peripheral Clock */
    __HAL_TIM_DISABLE(htim);

#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    if (htim->HallSensor_MspDeInitCallback == NULL)
    {
        htim->HallSensor_MspDeInitCallback = HAL_TIMEx_HallSensor_MspDeInit;
    }
    /* DeInit the low level hardware */
    htim->HallSensor_MspDeInitCallback(htim);
#else
    /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
    HAL_TIMEx_HallSensor_MspDeInit(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

    /* Change TIM state */
    htim->State = HAL_TIM_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @brief  Initializes the TIM Hall Sensor MSP.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval None
  */
__weak void HAL_TIMEx_HallSensor_MspInit(TIM_HandleTypeDef *htim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_TIMEx_HallSensor_MspInit could be implemented in the user file
     */
}

/**
  * @brief  DeInitializes TIM Hall Sensor MSP.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval None
  */
__weak void HAL_TIMEx_HallSensor_MspDeInit(TIM_HandleTypeDef *htim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_TIMEx_HallSensor_MspDeInit could be implemented in the user file
     */
}

/**
  * @brief  Starts the TIM Hall Sensor Interface.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Start(TIM_HandleTypeDef *htim)
{
    uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    /* Enable the Input Capture channel 1
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_ENABLE);

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    tmpsmcr = htim->Instance->SMCR & TIM_SMCR_SMS;
    if (!IS_TIM_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
        __HAL_TIM_ENABLE(htim);
    }

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Stops the TIM Hall sensor Interface.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Stop(TIM_HandleTypeDef *htim)
{
    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    /* Disable the Input Capture channels 1, 2 and 3
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_DISABLE);

    /* Disable the Peripheral */
    __HAL_TIM_DISABLE(htim);

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Starts the TIM Hall Sensor Interface in interrupt mode.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Start_IT(TIM_HandleTypeDef *htim)
{
    uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    /* Enable the capture compare Interrupts 1 event */
    __HAL_TIM_ENABLE_IT(htim, TIM_IT_CC1);

    /* Enable the Input Capture channel 1
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_ENABLE);

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    tmpsmcr = htim->Instance->SMCR & TIM_SMCR_SMS;
    if (!IS_TIM_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
        __HAL_TIM_ENABLE(htim);
    }

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Stops the TIM Hall Sensor Interface in interrupt mode.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Stop_IT(TIM_HandleTypeDef *htim)
{
    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    /* Disable the Input Capture channel 1
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_DISABLE);

    /* Disable the capture compare Interrupts event */
    __HAL_TIM_DISABLE_IT(htim, TIM_IT_CC1);

    /* Disable the Peripheral */
    __HAL_TIM_DISABLE(htim);

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Starts the TIM Hall Sensor Interface in DMA mode.
  * @param  htim TIM Hall Sensor Interface handle
  * @param  pData The destination Buffer address.
  * @param  Length The length of data to be transferred from TIM peripheral to memory.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Start_DMA(TIM_HandleTypeDef *htim, uint32_t *pData, uint16_t Length)
{
    uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    if (htim->State == HAL_TIM_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (htim->State == HAL_TIM_STATE_READY)
    {
        if (((uint32_t)pData == 0U) && (Length > 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            htim->State = HAL_TIM_STATE_BUSY;
        }
    }
    else
    {
        /* nothing to do */
    }
    /* Enable the Input Capture channel 1
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_ENABLE);

    /* Set the DMA Input Capture 1 Callbacks */
    htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMACaptureCplt;
    htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMACaptureHalfCplt;
    /* Set the DMA error callback */
    htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError ;

    /* Enable the DMA channel for Capture 1*/
    if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)&htim->Instance->CCR1, (uint32_t)pData, Length) != HAL_OK)
    {
        return HAL_ERROR;
    }
    /* Enable the capture compare 1 Interrupt */
    __HAL_TIM_ENABLE_DMA(htim, TIM_DMA_CC1);

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    tmpsmcr = htim->Instance->SMCR & TIM_SMCR_SMS;
    if (!IS_TIM_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
        __HAL_TIM_ENABLE(htim);
    }

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Stops the TIM Hall Sensor Interface in DMA mode.
  * @param  htim TIM Hall Sensor Interface handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_HallSensor_Stop_DMA(TIM_HandleTypeDef *htim)
{
    /* Check the parameters */
    assert_param(IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(htim->Instance));

    /* Disable the Input Capture channel 1
      (in the Hall Sensor Interface the three possible channels that can be used are TIM_CHANNEL_1, TIM_CHANNEL_2 and TIM_CHANNEL_3) */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_DISABLE);


    /* Disable the capture compare Interrupts 1 event */
    __HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC1);

