sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim_ex.c
    /* Change the handler state */
    htim->State = HAL_TIM_STATE_BUSY;

    /* Get the TIMx CR2 register value */
    tmpcr2 = htim->Instance->CR2;

    /* Get the TIMx SMCR register value */
    tmpsmcr = htim->Instance->SMCR;

    /* Reset the MMS Bits */
    tmpcr2 &= ~TIM_CR2_MMS;
    /* Select the TRGO source */
    tmpcr2 |=  sMasterConfig->MasterOutputTrigger;

    /* Update TIMx CR2 */
    htim->Instance->CR2 = tmpcr2;

    if (IS_TIM_SLAVE_INSTANCE(htim->Instance))
    {
        /* Reset the MSM Bit */
        tmpsmcr &= ~TIM_SMCR_MSM;
        /* Set master mode */
        tmpsmcr |= sMasterConfig->MasterSlaveMode;

        /* Update TIMx SMCR */
        htim->Instance->SMCR = tmpsmcr;
    }

    /* Change the htim state */
    htim->State = HAL_TIM_STATE_READY;

    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @brief  Configures the Break feature, dead time, Lock level, OSSI/OSSR State
  *         and the AOE(automatic output enable).
  * @param  htim TIM handle
  * @param  sBreakDeadTimeConfig pointer to a TIM_ConfigBreakDeadConfigTypeDef structure that
  *         contains the BDTR Register configuration  information for the TIM peripheral.
  * @note   Interrupts can be generated when an active level is detected on the
  *         break input, the break 2 input or the system break input. Break
  *         interrupt can be enabled by calling the @ref __HAL_TIM_ENABLE_IT macro.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_ConfigBreakDeadTime(TIM_HandleTypeDef *htim,
        TIM_BreakDeadTimeConfigTypeDef *sBreakDeadTimeConfig)
{
    /* Keep this variable initialized to 0 as it is used to configure BDTR register */
    uint32_t tmpbdtr = 0U;

    /* Check the parameters */
    assert_param(IS_TIM_BREAK_INSTANCE(htim->Instance));
    assert_param(IS_TIM_OSSR_STATE(sBreakDeadTimeConfig->OffStateRunMode));
    assert_param(IS_TIM_OSSI_STATE(sBreakDeadTimeConfig->OffStateIDLEMode));
    assert_param(IS_TIM_LOCK_LEVEL(sBreakDeadTimeConfig->LockLevel));
    assert_param(IS_TIM_DEADTIME(sBreakDeadTimeConfig->DeadTime));
    assert_param(IS_TIM_BREAK_STATE(sBreakDeadTimeConfig->BreakState));
    assert_param(IS_TIM_BREAK_POLARITY(sBreakDeadTimeConfig->BreakPolarity));
    assert_param(IS_TIM_AUTOMATIC_OUTPUT_STATE(sBreakDeadTimeConfig->AutomaticOutput));

    /* Check input state */
    __HAL_LOCK(htim);

    /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
       the OSSI State, the dead time value and the Automatic Output Enable Bit */

    /* Set the BDTR bits */
    MODIFY_REG(tmpbdtr, TIM_BDTR_DTG, sBreakDeadTimeConfig->DeadTime);
    MODIFY_REG(tmpbdtr, TIM_BDTR_LOCK, sBreakDeadTimeConfig->LockLevel);
    MODIFY_REG(tmpbdtr, TIM_BDTR_OSSI, sBreakDeadTimeConfig->OffStateIDLEMode);
    MODIFY_REG(tmpbdtr, TIM_BDTR_OSSR, sBreakDeadTimeConfig->OffStateRunMode);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BKE, sBreakDeadTimeConfig->BreakState);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BKP, sBreakDeadTimeConfig->BreakPolarity);
    MODIFY_REG(tmpbdtr, TIM_BDTR_AOE, sBreakDeadTimeConfig->AutomaticOutput);


    /* Set TIMx_BDTR */
    htim->Instance->BDTR = tmpbdtr;

    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM14, the parameter can have the following values:
  *           @arg TIM_TIM14_GPIO:    TIM14 TI1 is connected to GPIO
  *           @arg TIM_TIM14_RTC:     TIM14 TI1 is connected to RTC_clock
  *           @arg TIM_TIM14_HSE:     TIM14 TI1 is connected to HSE/32
  *           @arg TIM_TIM14_MCO:     TIM14 TI1 is connected to MCO
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
    __HAL_LOCK(htim);

    /* Check parameters */
    assert_param(IS_TIM_REMAP(htim->Instance, Remap));

    /* Set the Timer remapping configuration */
    WRITE_REG(htim->Instance->OR, Remap);

    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @}
  */

/** @defgroup TIMEx_Exported_Functions_Group6 Extended Callbacks functions
  * @brief    Extended Callbacks functions
  *
@verbatim
  ==============================================================================
                    ##### Extended Callbacks functions #####
  ==============================================================================
  [..]
    This section provides Extended TIM callback functions:
    (+) Timer Commutation callback
    (+) Timer Break callback

@endverbatim
  * @{
  */

/**
  * @brief  Hall commutation changed callback in non-blocking mode
  * @param  htim TIM handle
  * @retval None
  */
__weak void HAL_TIMEx_CommutCallback(TIM_HandleTypeDef *htim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_TIMEx_CommutCallback could be implemented in the user file
     */
}
/**
  * @brief  Hall commutation changed half complete callback in non-blocking mode
  * @param  htim TIM handle
  * @retval None
  */
__weak void HAL_TIMEx_CommutHalfCpltCallback(TIM_HandleTypeDef *htim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_TIMEx_CommutHalfCpltCallback could be implemented in the user file
     */
}

/**
  * @brief  Hall Break detection callback in non-blocking mode
  * @param  htim TIM handle
  * @retval None
  */
__weak void HAL_TIMEx_BreakCallback(TIM_HandleTypeDef *htim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_TIMEx_BreakCallback could be implemented in the user file
     */
}
/**
  * @}
  */

/** @defgroup TIMEx_Exported_Functions_Group7 Extended Peripheral State functions
  * @brief    Extended Peripheral State functions
  *
@verbatim
  ==============================================================================
                ##### Extended Peripheral State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the TIM Hall Sensor interface handle state.
  * @param  htim TIM Hall Sensor handle
  * @retval HAL state
  */
HAL_TIM_StateTypeDef HAL_TIMEx_HallSensor_GetState(TIM_HandleTypeDef *htim)
{
    return htim->State;
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup TIMEx_Private_Functions TIMEx Private Functions
  * @{
  */

/**
  * @brief  TIM DMA Commutation callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TIMEx_DMACommutationCplt(DMA_HandleTypeDef *hdma)
{
    TIM_HandleTypeDef *htim = (TIM_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

